MikroElektronika/core_packages/PIC/XC8/def/PIC16F1784/mcu.h
// Register: INLVLC
#define INLVLC INLVLC
extern volatile unsigned char           INLVLC              __at(0x38E);
#ifndef _LIB_BUILD
asm("INLVLC equ 038Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLC0                :1;
        unsigned INLVLC1                :1;
        unsigned INLVLC2                :1;
        unsigned INLVLC3                :1;
        unsigned INLVLC4                :1;
        unsigned INLVLC5                :1;
        unsigned INLVLC6                :1;
        unsigned INLVLC7                :1;
    };
    struct {
        unsigned INLVLC                 :8;
    };
} INLVLCbits_t;
extern volatile INLVLCbits_t INLVLCbits __at(0x38E);
// bitfield macros
#define _INLVLC_INLVLC0_POSN                                0x0
#define _INLVLC_INLVLC0_POSITION                            0x0
#define _INLVLC_INLVLC0_SIZE                                0x1
#define _INLVLC_INLVLC0_LENGTH                              0x1
#define _INLVLC_INLVLC0_MASK                                0x1
#define _INLVLC_INLVLC1_POSN                                0x1
#define _INLVLC_INLVLC1_POSITION                            0x1
#define _INLVLC_INLVLC1_SIZE                                0x1
#define _INLVLC_INLVLC1_LENGTH                              0x1
#define _INLVLC_INLVLC1_MASK                                0x2
#define _INLVLC_INLVLC2_POSN                                0x2
#define _INLVLC_INLVLC2_POSITION                            0x2
#define _INLVLC_INLVLC2_SIZE                                0x1
#define _INLVLC_INLVLC2_LENGTH                              0x1
#define _INLVLC_INLVLC2_MASK                                0x4
#define _INLVLC_INLVLC3_POSN                                0x3
#define _INLVLC_INLVLC3_POSITION                            0x3
#define _INLVLC_INLVLC3_SIZE                                0x1
#define _INLVLC_INLVLC3_LENGTH                              0x1
#define _INLVLC_INLVLC3_MASK                                0x8
#define _INLVLC_INLVLC4_POSN                                0x4
#define _INLVLC_INLVLC4_POSITION                            0x4
#define _INLVLC_INLVLC4_SIZE                                0x1
#define _INLVLC_INLVLC4_LENGTH                              0x1
#define _INLVLC_INLVLC4_MASK                                0x10
#define _INLVLC_INLVLC5_POSN                                0x5
#define _INLVLC_INLVLC5_POSITION                            0x5
#define _INLVLC_INLVLC5_SIZE                                0x1
#define _INLVLC_INLVLC5_LENGTH                              0x1
#define _INLVLC_INLVLC5_MASK                                0x20
#define _INLVLC_INLVLC6_POSN                                0x6
#define _INLVLC_INLVLC6_POSITION                            0x6
#define _INLVLC_INLVLC6_SIZE                                0x1
#define _INLVLC_INLVLC6_LENGTH                              0x1
#define _INLVLC_INLVLC6_MASK                                0x40
#define _INLVLC_INLVLC7_POSN                                0x7
#define _INLVLC_INLVLC7_POSITION                            0x7
#define _INLVLC_INLVLC7_SIZE                                0x1
#define _INLVLC_INLVLC7_LENGTH                              0x1
#define _INLVLC_INLVLC7_MASK                                0x80
#define _INLVLC_INLVLC_POSN                                 0x0
#define _INLVLC_INLVLC_POSITION                             0x0
#define _INLVLC_INLVLC_SIZE                                 0x8
#define _INLVLC_INLVLC_LENGTH                               0x8
#define _INLVLC_INLVLC_MASK                                 0xFF

// Register: INLVLD
#define INLVLD INLVLD
extern volatile unsigned char           INLVLD              __at(0x38F);
#ifndef _LIB_BUILD
asm("INLVLD equ 038Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLD0                :1;
        unsigned INLVLD1                :1;
        unsigned INLVLD2                :1;
        unsigned INLVLD3                :1;
        unsigned INLVLD4                :1;
        unsigned INLVLD5                :1;
        unsigned INLVLD6                :1;
        unsigned INLVLD7                :1;
    };
    struct {
        unsigned INLVLD                 :8;
    };
} INLVLDbits_t;
extern volatile INLVLDbits_t INLVLDbits __at(0x38F);
// bitfield macros
#define _INLVLD_INLVLD0_POSN                                0x0
#define _INLVLD_INLVLD0_POSITION                            0x0
#define _INLVLD_INLVLD0_SIZE                                0x1
#define _INLVLD_INLVLD0_LENGTH                              0x1
#define _INLVLD_INLVLD0_MASK                                0x1
#define _INLVLD_INLVLD1_POSN                                0x1
#define _INLVLD_INLVLD1_POSITION                            0x1
#define _INLVLD_INLVLD1_SIZE                                0x1
#define _INLVLD_INLVLD1_LENGTH                              0x1
#define _INLVLD_INLVLD1_MASK                                0x2
#define _INLVLD_INLVLD2_POSN                                0x2
#define _INLVLD_INLVLD2_POSITION                            0x2
#define _INLVLD_INLVLD2_SIZE                                0x1
#define _INLVLD_INLVLD2_LENGTH                              0x1
#define _INLVLD_INLVLD2_MASK                                0x4
#define _INLVLD_INLVLD3_POSN                                0x3
#define _INLVLD_INLVLD3_POSITION                            0x3
#define _INLVLD_INLVLD3_SIZE                                0x1
#define _INLVLD_INLVLD3_LENGTH                              0x1
#define _INLVLD_INLVLD3_MASK                                0x8
#define _INLVLD_INLVLD4_POSN                                0x4
#define _INLVLD_INLVLD4_POSITION                            0x4
#define _INLVLD_INLVLD4_SIZE                                0x1
#define _INLVLD_INLVLD4_LENGTH                              0x1
#define _INLVLD_INLVLD4_MASK                                0x10
#define _INLVLD_INLVLD5_POSN                                0x5
#define _INLVLD_INLVLD5_POSITION                            0x5
#define _INLVLD_INLVLD5_SIZE                                0x1
#define _INLVLD_INLVLD5_LENGTH                              0x1
#define _INLVLD_INLVLD5_MASK                                0x20
#define _INLVLD_INLVLD6_POSN                                0x6
#define _INLVLD_INLVLD6_POSITION                            0x6
#define _INLVLD_INLVLD6_SIZE                                0x1
#define _INLVLD_INLVLD6_LENGTH                              0x1
#define _INLVLD_INLVLD6_MASK                                0x40
#define _INLVLD_INLVLD7_POSN                                0x7
#define _INLVLD_INLVLD7_POSITION                            0x7
#define _INLVLD_INLVLD7_SIZE                                0x1
#define _INLVLD_INLVLD7_LENGTH                              0x1
#define _INLVLD_INLVLD7_MASK                                0x80
#define _INLVLD_INLVLD_POSN                                 0x0
#define _INLVLD_INLVLD_POSITION                             0x0
#define _INLVLD_INLVLD_SIZE                                 0x8
#define _INLVLD_INLVLD_LENGTH                               0x8
#define _INLVLD_INLVLD_MASK                                 0xFF

// Register: INLVLE
#define INLVLE INLVLE
extern volatile unsigned char           INLVLE              __at(0x390);
#ifndef _LIB_BUILD
asm("INLVLE equ 0390h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLE0                :1;
        unsigned INLVLE1                :1;
        unsigned INLVLE2                :1;
        unsigned INLVLE3                :1;
    };
    struct {
        unsigned INLVLE                 :4;
    };
} INLVLEbits_t;
extern volatile INLVLEbits_t INLVLEbits __at(0x390);
// bitfield macros
#define _INLVLE_INLVLE0_POSN                                0x0
#define _INLVLE_INLVLE0_POSITION                            0x0
#define _INLVLE_INLVLE0_SIZE                                0x1
#define _INLVLE_INLVLE0_LENGTH                              0x1
#define _INLVLE_INLVLE0_MASK                                0x1
#define _INLVLE_INLVLE1_POSN                                0x1
#define _INLVLE_INLVLE1_POSITION                            0x1
#define _INLVLE_INLVLE1_SIZE                                0x1
#define _INLVLE_INLVLE1_LENGTH                              0x1
#define _INLVLE_INLVLE1_MASK                                0x2
#define _INLVLE_INLVLE2_POSN                                0x2
#define _INLVLE_INLVLE2_POSITION                            0x2
#define _INLVLE_INLVLE2_SIZE                                0x1
#define _INLVLE_INLVLE2_LENGTH                              0x1
#define _INLVLE_INLVLE2_MASK                                0x4
#define _INLVLE_INLVLE3_POSN                                0x3
#define _INLVLE_INLVLE3_POSITION                            0x3
#define _INLVLE_INLVLE3_SIZE                                0x1
#define _INLVLE_INLVLE3_LENGTH                              0x1
#define _INLVLE_INLVLE3_MASK                                0x8
#define _INLVLE_INLVLE_POSN                                 0x0
#define _INLVLE_INLVLE_POSITION                             0x0
#define _INLVLE_INLVLE_SIZE                                 0x4
#define _INLVLE_INLVLE_LENGTH                               0x4
#define _INLVLE_INLVLE_MASK                                 0xF

// Register: IOCAP
#define IOCAP IOCAP
extern volatile unsigned char           IOCAP               __at(0x391);
#ifndef _LIB_BUILD
asm("IOCAP equ 0391h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCAP0                 :1;
        unsigned IOCAP1                 :1;
        unsigned IOCAP2                 :1;
        unsigned IOCAP3                 :1;
        unsigned IOCAP4                 :1;
        unsigned IOCAP5                 :1;
        unsigned IOCAP6                 :1;
        unsigned IOCAP7                 :1;
    };
    struct {
        unsigned IOCAP                  :8;
    };
} IOCAPbits_t;
