MikroElektronika/core_packages/PIC/XC8/def/PIC16F1784/mcu.h
// Register: PSMC3CON
#define PSMC3CON PSMC3CON
extern volatile unsigned char           PSMC3CON            __at(0x851);
#ifndef _LIB_BUILD
asm("PSMC3CON equ 0851h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3MODE                 :4;
        unsigned P3DBRE                 :1;
        unsigned P3DBFE                 :1;
        unsigned PSMC3LD                :1;
        unsigned PSMC3EN                :1;
    };
    struct {
        unsigned P3MODE0                :1;
        unsigned P3MODE1                :1;
        unsigned P3MODE2                :1;
        unsigned P3MODE3                :1;
    };
} PSMC3CONbits_t;
extern volatile PSMC3CONbits_t PSMC3CONbits __at(0x851);
// bitfield macros
#define _PSMC3CON_P3MODE_POSN                               0x0
#define _PSMC3CON_P3MODE_POSITION                           0x0
#define _PSMC3CON_P3MODE_SIZE                               0x4
#define _PSMC3CON_P3MODE_LENGTH                             0x4
#define _PSMC3CON_P3MODE_MASK                               0xF
#define _PSMC3CON_P3DBRE_POSN                               0x4
#define _PSMC3CON_P3DBRE_POSITION                           0x4
#define _PSMC3CON_P3DBRE_SIZE                               0x1
#define _PSMC3CON_P3DBRE_LENGTH                             0x1
#define _PSMC3CON_P3DBRE_MASK                               0x10
#define _PSMC3CON_P3DBFE_POSN                               0x5
#define _PSMC3CON_P3DBFE_POSITION                           0x5
#define _PSMC3CON_P3DBFE_SIZE                               0x1
#define _PSMC3CON_P3DBFE_LENGTH                             0x1
#define _PSMC3CON_P3DBFE_MASK                               0x20
#define _PSMC3CON_PSMC3LD_POSN                              0x6
#define _PSMC3CON_PSMC3LD_POSITION                          0x6
#define _PSMC3CON_PSMC3LD_SIZE                              0x1
#define _PSMC3CON_PSMC3LD_LENGTH                            0x1
#define _PSMC3CON_PSMC3LD_MASK                              0x40
#define _PSMC3CON_PSMC3EN_POSN                              0x7
#define _PSMC3CON_PSMC3EN_POSITION                          0x7
#define _PSMC3CON_PSMC3EN_SIZE                              0x1
#define _PSMC3CON_PSMC3EN_LENGTH                            0x1
#define _PSMC3CON_PSMC3EN_MASK                              0x80
#define _PSMC3CON_P3MODE0_POSN                              0x0
#define _PSMC3CON_P3MODE0_POSITION                          0x0
#define _PSMC3CON_P3MODE0_SIZE                              0x1
#define _PSMC3CON_P3MODE0_LENGTH                            0x1
#define _PSMC3CON_P3MODE0_MASK                              0x1
#define _PSMC3CON_P3MODE1_POSN                              0x1
#define _PSMC3CON_P3MODE1_POSITION                          0x1
#define _PSMC3CON_P3MODE1_SIZE                              0x1
#define _PSMC3CON_P3MODE1_LENGTH                            0x1
#define _PSMC3CON_P3MODE1_MASK                              0x2
#define _PSMC3CON_P3MODE2_POSN                              0x2
#define _PSMC3CON_P3MODE2_POSITION                          0x2
#define _PSMC3CON_P3MODE2_SIZE                              0x1
#define _PSMC3CON_P3MODE2_LENGTH                            0x1
#define _PSMC3CON_P3MODE2_MASK                              0x4
#define _PSMC3CON_P3MODE3_POSN                              0x3
#define _PSMC3CON_P3MODE3_POSITION                          0x3
#define _PSMC3CON_P3MODE3_SIZE                              0x1
#define _PSMC3CON_P3MODE3_LENGTH                            0x1
#define _PSMC3CON_P3MODE3_MASK                              0x8

// Register: PSMC3MDL
#define PSMC3MDL PSMC3MDL
extern volatile unsigned char           PSMC3MDL            __at(0x852);
#ifndef _LIB_BUILD
asm("PSMC3MDL equ 0852h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3MSRC                 :4;
        unsigned                        :1;
        unsigned P3MDLBIT               :1;
        unsigned P3MDLPOL               :1;
        unsigned P3MDLEN                :1;
    };
    struct {
        unsigned P3MSRC0                :1;
        unsigned P3MSRC1                :1;
        unsigned P3MSRC2                :1;
        unsigned P3MSRC3                :1;
    };
} PSMC3MDLbits_t;
extern volatile PSMC3MDLbits_t PSMC3MDLbits __at(0x852);
// bitfield macros
#define _PSMC3MDL_P3MSRC_POSN                               0x0
#define _PSMC3MDL_P3MSRC_POSITION                           0x0
#define _PSMC3MDL_P3MSRC_SIZE                               0x4
#define _PSMC3MDL_P3MSRC_LENGTH                             0x4
#define _PSMC3MDL_P3MSRC_MASK                               0xF
#define _PSMC3MDL_P3MDLBIT_POSN                             0x5
#define _PSMC3MDL_P3MDLBIT_POSITION                         0x5
#define _PSMC3MDL_P3MDLBIT_SIZE                             0x1
#define _PSMC3MDL_P3MDLBIT_LENGTH                           0x1
#define _PSMC3MDL_P3MDLBIT_MASK                             0x20
#define _PSMC3MDL_P3MDLPOL_POSN                             0x6
#define _PSMC3MDL_P3MDLPOL_POSITION                         0x6
#define _PSMC3MDL_P3MDLPOL_SIZE                             0x1
#define _PSMC3MDL_P3MDLPOL_LENGTH                           0x1
#define _PSMC3MDL_P3MDLPOL_MASK                             0x40
#define _PSMC3MDL_P3MDLEN_POSN                              0x7
#define _PSMC3MDL_P3MDLEN_POSITION                          0x7
#define _PSMC3MDL_P3MDLEN_SIZE                              0x1
#define _PSMC3MDL_P3MDLEN_LENGTH                            0x1
#define _PSMC3MDL_P3MDLEN_MASK                              0x80
#define _PSMC3MDL_P3MSRC0_POSN                              0x0
#define _PSMC3MDL_P3MSRC0_POSITION                          0x0
#define _PSMC3MDL_P3MSRC0_SIZE                              0x1
#define _PSMC3MDL_P3MSRC0_LENGTH                            0x1
#define _PSMC3MDL_P3MSRC0_MASK                              0x1
#define _PSMC3MDL_P3MSRC1_POSN                              0x1
#define _PSMC3MDL_P3MSRC1_POSITION                          0x1
#define _PSMC3MDL_P3MSRC1_SIZE                              0x1
#define _PSMC3MDL_P3MSRC1_LENGTH                            0x1
#define _PSMC3MDL_P3MSRC1_MASK                              0x2
#define _PSMC3MDL_P3MSRC2_POSN                              0x2
#define _PSMC3MDL_P3MSRC2_POSITION                          0x2
#define _PSMC3MDL_P3MSRC2_SIZE                              0x1
#define _PSMC3MDL_P3MSRC2_LENGTH                            0x1
#define _PSMC3MDL_P3MSRC2_MASK                              0x4
#define _PSMC3MDL_P3MSRC3_POSN                              0x3
#define _PSMC3MDL_P3MSRC3_POSITION                          0x3
#define _PSMC3MDL_P3MSRC3_SIZE                              0x1
#define _PSMC3MDL_P3MSRC3_LENGTH                            0x1
#define _PSMC3MDL_P3MSRC3_MASK                              0x8

// Register: PSMC3SYNC
#define PSMC3SYNC PSMC3SYNC
extern volatile unsigned char           PSMC3SYNC           __at(0x853);
#ifndef _LIB_BUILD
asm("PSMC3SYNC equ 0853h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3SYNC0                :1;
        unsigned P3SYNC1                :1;
        unsigned P3SYNC2                :1;
        unsigned                        :2;
        unsigned P3DCPOL                :1;
        unsigned P3PRPOL                :1;
        unsigned P3POFST                :1;
    };
} PSMC3SYNCbits_t;
extern volatile PSMC3SYNCbits_t PSMC3SYNCbits __at(0x853);
// bitfield macros
#define _PSMC3SYNC_P3SYNC0_POSN                             0x0
#define _PSMC3SYNC_P3SYNC0_POSITION                         0x0
#define _PSMC3SYNC_P3SYNC0_SIZE                             0x1
#define _PSMC3SYNC_P3SYNC0_LENGTH                           0x1
#define _PSMC3SYNC_P3SYNC0_MASK                             0x1
#define _PSMC3SYNC_P3SYNC1_POSN                             0x1
#define _PSMC3SYNC_P3SYNC1_POSITION                         0x1
#define _PSMC3SYNC_P3SYNC1_SIZE                             0x1
#define _PSMC3SYNC_P3SYNC1_LENGTH                           0x1
#define _PSMC3SYNC_P3SYNC1_MASK                             0x2
#define _PSMC3SYNC_P3SYNC2_POSN                             0x2
#define _PSMC3SYNC_P3SYNC2_POSITION                         0x2
#define _PSMC3SYNC_P3SYNC2_SIZE                             0x1
#define _PSMC3SYNC_P3SYNC2_LENGTH                           0x1
#define _PSMC3SYNC_P3SYNC2_MASK                             0x4
#define _PSMC3SYNC_P3DCPOL_POSN                             0x5
#define _PSMC3SYNC_P3DCPOL_POSITION                         0x5
#define _PSMC3SYNC_P3DCPOL_SIZE                             0x1
#define _PSMC3SYNC_P3DCPOL_LENGTH                           0x1
#define _PSMC3SYNC_P3DCPOL_MASK                             0x20
#define _PSMC3SYNC_P3PRPOL_POSN                             0x6
#define _PSMC3SYNC_P3PRPOL_POSITION                         0x6
#define _PSMC3SYNC_P3PRPOL_SIZE                             0x1
#define _PSMC3SYNC_P3PRPOL_LENGTH                           0x1
#define _PSMC3SYNC_P3PRPOL_MASK                             0x40
#define _PSMC3SYNC_P3POFST_POSN                             0x7
#define _PSMC3SYNC_P3POFST_POSITION                         0x7
#define _PSMC3SYNC_P3POFST_SIZE                             0x1
#define _PSMC3SYNC_P3POFST_LENGTH                           0x1
#define _PSMC3SYNC_P3POFST_MASK                             0x80

