MikroElektronika/core_packages/PIC/XC8/def/PIC16F1784/mcu.h
// Register: PSMC3PRH
#define PSMC3PRH PSMC3PRH
extern volatile unsigned char           PSMC3PRH            __at(0x866);
#ifndef _LIB_BUILD
asm("PSMC3PRH equ 0866h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3PR8               :1;
        unsigned PSMC3PR9               :1;
        unsigned PSMC3PR10              :1;
        unsigned PSMC3PR11              :1;
        unsigned PSMC3PR12              :1;
        unsigned PSMC3PR13              :1;
        unsigned PSMC3PR14              :1;
        unsigned PSMC3PR15              :1;
    };
} PSMC3PRHbits_t;
extern volatile PSMC3PRHbits_t PSMC3PRHbits __at(0x866);
// bitfield macros
#define _PSMC3PRH_PSMC3PR8_POSN                             0x0
#define _PSMC3PRH_PSMC3PR8_POSITION                         0x0
#define _PSMC3PRH_PSMC3PR8_SIZE                             0x1
#define _PSMC3PRH_PSMC3PR8_LENGTH                           0x1
#define _PSMC3PRH_PSMC3PR8_MASK                             0x1
#define _PSMC3PRH_PSMC3PR9_POSN                             0x1
#define _PSMC3PRH_PSMC3PR9_POSITION                         0x1
#define _PSMC3PRH_PSMC3PR9_SIZE                             0x1
#define _PSMC3PRH_PSMC3PR9_LENGTH                           0x1
#define _PSMC3PRH_PSMC3PR9_MASK                             0x2
#define _PSMC3PRH_PSMC3PR10_POSN                            0x2
#define _PSMC3PRH_PSMC3PR10_POSITION                        0x2
#define _PSMC3PRH_PSMC3PR10_SIZE                            0x1
#define _PSMC3PRH_PSMC3PR10_LENGTH                          0x1
#define _PSMC3PRH_PSMC3PR10_MASK                            0x4
#define _PSMC3PRH_PSMC3PR11_POSN                            0x3
#define _PSMC3PRH_PSMC3PR11_POSITION                        0x3
#define _PSMC3PRH_PSMC3PR11_SIZE                            0x1
#define _PSMC3PRH_PSMC3PR11_LENGTH                          0x1
#define _PSMC3PRH_PSMC3PR11_MASK                            0x8
#define _PSMC3PRH_PSMC3PR12_POSN                            0x4
#define _PSMC3PRH_PSMC3PR12_POSITION                        0x4
#define _PSMC3PRH_PSMC3PR12_SIZE                            0x1
#define _PSMC3PRH_PSMC3PR12_LENGTH                          0x1
#define _PSMC3PRH_PSMC3PR12_MASK                            0x10
#define _PSMC3PRH_PSMC3PR13_POSN                            0x5
#define _PSMC3PRH_PSMC3PR13_POSITION                        0x5
#define _PSMC3PRH_PSMC3PR13_SIZE                            0x1
#define _PSMC3PRH_PSMC3PR13_LENGTH                          0x1
#define _PSMC3PRH_PSMC3PR13_MASK                            0x20
#define _PSMC3PRH_PSMC3PR14_POSN                            0x6
#define _PSMC3PRH_PSMC3PR14_POSITION                        0x6
#define _PSMC3PRH_PSMC3PR14_SIZE                            0x1
#define _PSMC3PRH_PSMC3PR14_LENGTH                          0x1
#define _PSMC3PRH_PSMC3PR14_MASK                            0x40
#define _PSMC3PRH_PSMC3PR15_POSN                            0x7
#define _PSMC3PRH_PSMC3PR15_POSITION                        0x7
#define _PSMC3PRH_PSMC3PR15_SIZE                            0x1
#define _PSMC3PRH_PSMC3PR15_LENGTH                          0x1
#define _PSMC3PRH_PSMC3PR15_MASK                            0x80

// Register: PSMC3TMR
#define PSMC3TMR PSMC3TMR
extern volatile unsigned short          PSMC3TMR            __at(0x867);
#ifndef _LIB_BUILD
asm("PSMC3TMR equ 0867h");
#endif

// Register: PSMC3TMRL
#define PSMC3TMRL PSMC3TMRL
extern volatile unsigned char           PSMC3TMRL           __at(0x867);
#ifndef _LIB_BUILD
asm("PSMC3TMRL equ 0867h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3TMR0              :1;
        unsigned PSMC3TMR1              :1;
        unsigned PSMC3TMR2              :1;
        unsigned PSMC3TMR3              :1;
        unsigned PSMC3TMR4              :1;
        unsigned PSMC3TMR5              :1;
        unsigned PSMC3TMR6              :1;
        unsigned PSMC3TMR7              :1;
    };
} PSMC3TMRLbits_t;
extern volatile PSMC3TMRLbits_t PSMC3TMRLbits __at(0x867);
// bitfield macros
#define _PSMC3TMRL_PSMC3TMR0_POSN                           0x0
#define _PSMC3TMRL_PSMC3TMR0_POSITION                       0x0
#define _PSMC3TMRL_PSMC3TMR0_SIZE                           0x1
#define _PSMC3TMRL_PSMC3TMR0_LENGTH                         0x1
#define _PSMC3TMRL_PSMC3TMR0_MASK                           0x1
#define _PSMC3TMRL_PSMC3TMR1_POSN                           0x1
#define _PSMC3TMRL_PSMC3TMR1_POSITION                       0x1
#define _PSMC3TMRL_PSMC3TMR1_SIZE                           0x1
#define _PSMC3TMRL_PSMC3TMR1_LENGTH                         0x1
#define _PSMC3TMRL_PSMC3TMR1_MASK                           0x2
#define _PSMC3TMRL_PSMC3TMR2_POSN                           0x2
#define _PSMC3TMRL_PSMC3TMR2_POSITION                       0x2
#define _PSMC3TMRL_PSMC3TMR2_SIZE                           0x1
#define _PSMC3TMRL_PSMC3TMR2_LENGTH                         0x1
#define _PSMC3TMRL_PSMC3TMR2_MASK                           0x4
#define _PSMC3TMRL_PSMC3TMR3_POSN                           0x3
#define _PSMC3TMRL_PSMC3TMR3_POSITION                       0x3
#define _PSMC3TMRL_PSMC3TMR3_SIZE                           0x1
#define _PSMC3TMRL_PSMC3TMR3_LENGTH                         0x1
#define _PSMC3TMRL_PSMC3TMR3_MASK                           0x8
#define _PSMC3TMRL_PSMC3TMR4_POSN                           0x4
#define _PSMC3TMRL_PSMC3TMR4_POSITION                       0x4
#define _PSMC3TMRL_PSMC3TMR4_SIZE                           0x1
#define _PSMC3TMRL_PSMC3TMR4_LENGTH                         0x1
#define _PSMC3TMRL_PSMC3TMR4_MASK                           0x10
#define _PSMC3TMRL_PSMC3TMR5_POSN                           0x5
#define _PSMC3TMRL_PSMC3TMR5_POSITION                       0x5
#define _PSMC3TMRL_PSMC3TMR5_SIZE                           0x1
#define _PSMC3TMRL_PSMC3TMR5_LENGTH                         0x1
#define _PSMC3TMRL_PSMC3TMR5_MASK                           0x20
#define _PSMC3TMRL_PSMC3TMR6_POSN                           0x6
#define _PSMC3TMRL_PSMC3TMR6_POSITION                       0x6
#define _PSMC3TMRL_PSMC3TMR6_SIZE                           0x1
#define _PSMC3TMRL_PSMC3TMR6_LENGTH                         0x1
#define _PSMC3TMRL_PSMC3TMR6_MASK                           0x40
#define _PSMC3TMRL_PSMC3TMR7_POSN                           0x7
#define _PSMC3TMRL_PSMC3TMR7_POSITION                       0x7
#define _PSMC3TMRL_PSMC3TMR7_SIZE                           0x1
#define _PSMC3TMRL_PSMC3TMR7_LENGTH                         0x1
#define _PSMC3TMRL_PSMC3TMR7_MASK                           0x80

// Register: PSMC3TMRH
#define PSMC3TMRH PSMC3TMRH
extern volatile unsigned char           PSMC3TMRH           __at(0x868);
#ifndef _LIB_BUILD
asm("PSMC3TMRH equ 0868h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3TMR8              :1;
        unsigned PSMC3TMR9              :1;
        unsigned PSMC3TMR10             :1;
        unsigned PSMC3TMR11             :1;
        unsigned PSMC3TMR12             :1;
        unsigned PSMC3TMR13             :1;
        unsigned PSMC3TMR14             :1;
        unsigned PSMC3TMR15             :1;
    };
} PSMC3TMRHbits_t;
