MikroElektronika/core_packages/PIC/XC8/def/PIC16F1784/mcu.h
// Register: PSMC3BLKF
#define PSMC3BLKF PSMC3BLKF
extern volatile unsigned char           PSMC3BLKF           __at(0x86C);
#ifndef _LIB_BUILD
asm("PSMC3BLKF equ 086Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3BLKF0             :1;
        unsigned PSMC3BLKF1             :1;
        unsigned PSMC3BLKF2             :1;
        unsigned PSMC3BLKF3             :1;
        unsigned PSMC3BLKF4             :1;
        unsigned PSMC3BLKF5             :1;
        unsigned PSMC3BLKF6             :1;
        unsigned PSMC3BLKF7             :1;
    };
} PSMC3BLKFbits_t;
extern volatile PSMC3BLKFbits_t PSMC3BLKFbits __at(0x86C);
// bitfield macros
#define _PSMC3BLKF_PSMC3BLKF0_POSN                          0x0
#define _PSMC3BLKF_PSMC3BLKF0_POSITION                      0x0
#define _PSMC3BLKF_PSMC3BLKF0_SIZE                          0x1
#define _PSMC3BLKF_PSMC3BLKF0_LENGTH                        0x1
#define _PSMC3BLKF_PSMC3BLKF0_MASK                          0x1
#define _PSMC3BLKF_PSMC3BLKF1_POSN                          0x1
#define _PSMC3BLKF_PSMC3BLKF1_POSITION                      0x1
#define _PSMC3BLKF_PSMC3BLKF1_SIZE                          0x1
#define _PSMC3BLKF_PSMC3BLKF1_LENGTH                        0x1
#define _PSMC3BLKF_PSMC3BLKF1_MASK                          0x2
#define _PSMC3BLKF_PSMC3BLKF2_POSN                          0x2
#define _PSMC3BLKF_PSMC3BLKF2_POSITION                      0x2
#define _PSMC3BLKF_PSMC3BLKF2_SIZE                          0x1
#define _PSMC3BLKF_PSMC3BLKF2_LENGTH                        0x1
#define _PSMC3BLKF_PSMC3BLKF2_MASK                          0x4
#define _PSMC3BLKF_PSMC3BLKF3_POSN                          0x3
#define _PSMC3BLKF_PSMC3BLKF3_POSITION                      0x3
#define _PSMC3BLKF_PSMC3BLKF3_SIZE                          0x1
#define _PSMC3BLKF_PSMC3BLKF3_LENGTH                        0x1
#define _PSMC3BLKF_PSMC3BLKF3_MASK                          0x8
#define _PSMC3BLKF_PSMC3BLKF4_POSN                          0x4
#define _PSMC3BLKF_PSMC3BLKF4_POSITION                      0x4
#define _PSMC3BLKF_PSMC3BLKF4_SIZE                          0x1
#define _PSMC3BLKF_PSMC3BLKF4_LENGTH                        0x1
#define _PSMC3BLKF_PSMC3BLKF4_MASK                          0x10
#define _PSMC3BLKF_PSMC3BLKF5_POSN                          0x5
#define _PSMC3BLKF_PSMC3BLKF5_POSITION                      0x5
#define _PSMC3BLKF_PSMC3BLKF5_SIZE                          0x1
#define _PSMC3BLKF_PSMC3BLKF5_LENGTH                        0x1
#define _PSMC3BLKF_PSMC3BLKF5_MASK                          0x20
#define _PSMC3BLKF_PSMC3BLKF6_POSN                          0x6
#define _PSMC3BLKF_PSMC3BLKF6_POSITION                      0x6
#define _PSMC3BLKF_PSMC3BLKF6_SIZE                          0x1
#define _PSMC3BLKF_PSMC3BLKF6_LENGTH                        0x1
#define _PSMC3BLKF_PSMC3BLKF6_MASK                          0x40
#define _PSMC3BLKF_PSMC3BLKF7_POSN                          0x7
#define _PSMC3BLKF_PSMC3BLKF7_POSITION                      0x7
#define _PSMC3BLKF_PSMC3BLKF7_SIZE                          0x1
#define _PSMC3BLKF_PSMC3BLKF7_LENGTH                        0x1
#define _PSMC3BLKF_PSMC3BLKF7_MASK                          0x80

// Register: PSMC3FFA
#define PSMC3FFA PSMC3FFA
extern volatile unsigned char           PSMC3FFA            __at(0x86D);
#ifndef _LIB_BUILD
asm("PSMC3FFA equ 086Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PSMC3FFA0              :1;
        unsigned PSMC3FFA1              :1;
        unsigned PSMC3FFA2              :1;
        unsigned PSMC3FFA3              :1;
    };
} PSMC3FFAbits_t;
extern volatile PSMC3FFAbits_t PSMC3FFAbits __at(0x86D);
// bitfield macros
#define _PSMC3FFA_PSMC3FFA0_POSN                            0x0
#define _PSMC3FFA_PSMC3FFA0_POSITION                        0x0
#define _PSMC3FFA_PSMC3FFA0_SIZE                            0x1
#define _PSMC3FFA_PSMC3FFA0_LENGTH                          0x1
#define _PSMC3FFA_PSMC3FFA0_MASK                            0x1
#define _PSMC3FFA_PSMC3FFA1_POSN                            0x1
#define _PSMC3FFA_PSMC3FFA1_POSITION                        0x1
#define _PSMC3FFA_PSMC3FFA1_SIZE                            0x1
#define _PSMC3FFA_PSMC3FFA1_LENGTH                          0x1
#define _PSMC3FFA_PSMC3FFA1_MASK                            0x2
#define _PSMC3FFA_PSMC3FFA2_POSN                            0x2
#define _PSMC3FFA_PSMC3FFA2_POSITION                        0x2
#define _PSMC3FFA_PSMC3FFA2_SIZE                            0x1
#define _PSMC3FFA_PSMC3FFA2_LENGTH                          0x1
#define _PSMC3FFA_PSMC3FFA2_MASK                            0x4
#define _PSMC3FFA_PSMC3FFA3_POSN                            0x3
#define _PSMC3FFA_PSMC3FFA3_POSITION                        0x3
#define _PSMC3FFA_PSMC3FFA3_SIZE                            0x1
#define _PSMC3FFA_PSMC3FFA3_LENGTH                          0x1
#define _PSMC3FFA_PSMC3FFA3_MASK                            0x8

// Register: PSMC3STR0
#define PSMC3STR0 PSMC3STR0
extern volatile unsigned char           PSMC3STR0           __at(0x86E);
#ifndef _LIB_BUILD
asm("PSMC3STR0 equ 086Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3STRA                 :1;
        unsigned P3STRB                 :1;
        unsigned P3STRC                 :1;
        unsigned P3STRD                 :1;
        unsigned P3STRE                 :1;
        unsigned P3STRF                 :1;
    };
} PSMC3STR0bits_t;
extern volatile PSMC3STR0bits_t PSMC3STR0bits __at(0x86E);
// bitfield macros
#define _PSMC3STR0_P3STRA_POSN                              0x0
#define _PSMC3STR0_P3STRA_POSITION                          0x0
#define _PSMC3STR0_P3STRA_SIZE                              0x1
#define _PSMC3STR0_P3STRA_LENGTH                            0x1
#define _PSMC3STR0_P3STRA_MASK                              0x1
#define _PSMC3STR0_P3STRB_POSN                              0x1
#define _PSMC3STR0_P3STRB_POSITION                          0x1
#define _PSMC3STR0_P3STRB_SIZE                              0x1
#define _PSMC3STR0_P3STRB_LENGTH                            0x1
#define _PSMC3STR0_P3STRB_MASK                              0x2
#define _PSMC3STR0_P3STRC_POSN                              0x2
#define _PSMC3STR0_P3STRC_POSITION                          0x2
#define _PSMC3STR0_P3STRC_SIZE                              0x1
#define _PSMC3STR0_P3STRC_LENGTH                            0x1
#define _PSMC3STR0_P3STRC_MASK                              0x4
#define _PSMC3STR0_P3STRD_POSN                              0x3
#define _PSMC3STR0_P3STRD_POSITION                          0x3
#define _PSMC3STR0_P3STRD_SIZE                              0x1
#define _PSMC3STR0_P3STRD_LENGTH                            0x1
#define _PSMC3STR0_P3STRD_MASK                              0x8
#define _PSMC3STR0_P3STRE_POSN                              0x4
#define _PSMC3STR0_P3STRE_POSITION                          0x4
#define _PSMC3STR0_P3STRE_SIZE                              0x1
#define _PSMC3STR0_P3STRE_LENGTH                            0x1
#define _PSMC3STR0_P3STRE_MASK                              0x10
#define _PSMC3STR0_P3STRF_POSN                              0x5
#define _PSMC3STR0_P3STRF_POSITION                          0x5
#define _PSMC3STR0_P3STRF_SIZE                              0x1
#define _PSMC3STR0_P3STRF_LENGTH                            0x1
#define _PSMC3STR0_P3STRF_MASK                              0x20

// Register: PSMC3STR1
#define PSMC3STR1 PSMC3STR1
extern volatile unsigned char           PSMC3STR1           __at(0x86F);
#ifndef _LIB_BUILD
asm("PSMC3STR1 equ 086Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3HSMEN                :1;
        unsigned P3LSMEN                :1;
        unsigned                        :5;
        unsigned P3SSYNC                :1;
    };
} PSMC3STR1bits_t;
