MikroElektronika/core_packages/PIC/XC8/def/PIC16F1784/mcu.h
#define                                 P2PHSIN_bit         _BIT_ACCESS(PSMC2PHS,7)
// PSMC2PHS<P2PHST>
extern volatile __bit                   P2PHST              __at(0x41D0);	// @ (0x83A * 8 + 0)
#define                                 P2PHST_bit          _BIT_ACCESS(PSMC2PHS,0)
// PSMC2SYNC<P2POFST>
extern volatile __bit                   P2POFST             __at(0x419F);	// @ (0x833 * 8 + 7)
#define                                 P2POFST_bit         _BIT_ACCESS(PSMC2SYNC,7)
// PSMC2POL<P2POLA>
extern volatile __bit                   P2POLA              __at(0x41B0);	// @ (0x836 * 8 + 0)
#define                                 P2POLA_bit          _BIT_ACCESS(PSMC2POL,0)
// PSMC2POL<P2POLB>
extern volatile __bit                   P2POLB              __at(0x41B1);	// @ (0x836 * 8 + 1)
#define                                 P2POLB_bit          _BIT_ACCESS(PSMC2POL,1)
// PSMC2SYNC<P2PRPOL>
extern volatile __bit                   P2PRPOL             __at(0x419E);	// @ (0x833 * 8 + 6)
#define                                 P2PRPOL_bit         _BIT_ACCESS(PSMC2SYNC,6)
// PSMC2PRS<P2PRSC1>
extern volatile __bit                   P2PRSC1             __at(0x41E1);	// @ (0x83C * 8 + 1)
#define                                 P2PRSC1_bit         _BIT_ACCESS(PSMC2PRS,1)
// PSMC2PRS<P2PRSC2>
extern volatile __bit                   P2PRSC2             __at(0x41E2);	// @ (0x83C * 8 + 2)
#define                                 P2PRSC2_bit         _BIT_ACCESS(PSMC2PRS,2)
// PSMC2PRS<P2PRSC3>
extern volatile __bit                   P2PRSC3             __at(0x41E3);	// @ (0x83C * 8 + 3)
#define                                 P2PRSC3_bit         _BIT_ACCESS(PSMC2PRS,3)
// PSMC2PRS<P2PRSC4>
extern volatile __bit                   P2PRSC4             __at(0x41E4);	// @ (0x83C * 8 + 4)
#define                                 P2PRSC4_bit         _BIT_ACCESS(PSMC2PRS,4)
// PSMC2PRS<P2PRSIN>
extern volatile __bit                   P2PRSIN             __at(0x41E7);	// @ (0x83C * 8 + 7)
#define                                 P2PRSIN_bit         _BIT_ACCESS(PSMC2PRS,7)
// PSMC2PRS<P2PRST>
extern volatile __bit                   P2PRST              __at(0x41E0);	// @ (0x83C * 8 + 0)
#define                                 P2PRST_bit          _BIT_ACCESS(PSMC2PRS,0)
// PSMC2BLNK<P2REBM0>
extern volatile __bit                   P2REBM0             __at(0x41B8);	// @ (0x837 * 8 + 0)
#define                                 P2REBM0_bit         _BIT_ACCESS(PSMC2BLNK,0)
// PSMC2BLNK<P2REBM1>
extern volatile __bit                   P2REBM1             __at(0x41B9);	// @ (0x837 * 8 + 1)
#define                                 P2REBM1_bit         _BIT_ACCESS(PSMC2BLNK,1)
// PSMC2REBS<P2REBSC1>
extern volatile __bit                   P2REBSC1            __at(0x41C1);	// @ (0x838 * 8 + 1)
#define                                 P2REBSC1_bit        _BIT_ACCESS(PSMC2REBS,1)
// PSMC2REBS<P2REBSC2>
extern volatile __bit                   P2REBSC2            __at(0x41C2);	// @ (0x838 * 8 + 2)
#define                                 P2REBSC2_bit        _BIT_ACCESS(PSMC2REBS,2)
// PSMC2REBS<P2REBSC3>
extern volatile __bit                   P2REBSC3            __at(0x41C3);	// @ (0x838 * 8 + 3)
#define                                 P2REBSC3_bit        _BIT_ACCESS(PSMC2REBS,3)
// PSMC2REBS<P2REBSC4>
extern volatile __bit                   P2REBSC4            __at(0x41C4);	// @ (0x838 * 8 + 4)
#define                                 P2REBSC4_bit        _BIT_ACCESS(PSMC2REBS,4)
// PSMC2REBS<P2REBSIN>
extern volatile __bit                   P2REBSIN            __at(0x41C7);	// @ (0x838 * 8 + 7)
#define                                 P2REBSIN_bit        _BIT_ACCESS(PSMC2REBS,7)
// PSMC2STR1<P2SSYNC>
extern volatile __bit                   P2SSYNC             __at(0x427F);	// @ (0x84F * 8 + 7)
#define                                 P2SSYNC_bit         _BIT_ACCESS(PSMC2STR1,7)
// PSMC2STR0<P2STRA>
extern volatile __bit                   P2STRA              __at(0x4270);	// @ (0x84E * 8 + 0)
#define                                 P2STRA_bit          _BIT_ACCESS(PSMC2STR0,0)
// PSMC2STR0<P2STRB>
extern volatile __bit                   P2STRB              __at(0x4271);	// @ (0x84E * 8 + 1)
#define                                 P2STRB_bit          _BIT_ACCESS(PSMC2STR0,1)
// PSMC2SYNC<P2SYNC0>
extern volatile __bit                   P2SYNC0             __at(0x4198);	// @ (0x833 * 8 + 0)
#define                                 P2SYNC0_bit         _BIT_ACCESS(PSMC2SYNC,0)
// PSMC2SYNC<P2SYNC1>
extern volatile __bit                   P2SYNC1             __at(0x4199);	// @ (0x833 * 8 + 1)
#define                                 P2SYNC1_bit         _BIT_ACCESS(PSMC2SYNC,1)
// PSMC2SYNC<P2SYNC2>
extern volatile __bit                   P2SYNC2             __at(0x419A);	// @ (0x833 * 8 + 2)
#define                                 P2SYNC2_bit         _BIT_ACCESS(PSMC2SYNC,2)
// PSMC2INT<P2TDCIE>
extern volatile __bit                   P2TDCIE             __at(0x4205);	// @ (0x840 * 8 + 5)
#define                                 P2TDCIE_bit         _BIT_ACCESS(PSMC2INT,5)
// PSMC2INT<P2TDCIF>
extern volatile __bit                   P2TDCIF             __at(0x4201);	// @ (0x840 * 8 + 1)
#define                                 P2TDCIF_bit         _BIT_ACCESS(PSMC2INT,1)
// PSMC2INT<P2TOVIE>
extern volatile __bit                   P2TOVIE             __at(0x4207);	// @ (0x840 * 8 + 7)
#define                                 P2TOVIE_bit         _BIT_ACCESS(PSMC2INT,7)
// PSMC2INT<P2TOVIF>
extern volatile __bit                   P2TOVIF             __at(0x4203);	// @ (0x840 * 8 + 3)
#define                                 P2TOVIF_bit         _BIT_ACCESS(PSMC2INT,3)
// PSMC2INT<P2TPHIE>
extern volatile __bit                   P2TPHIE             __at(0x4206);	// @ (0x840 * 8 + 6)
#define                                 P2TPHIE_bit         _BIT_ACCESS(PSMC2INT,6)
// PSMC2INT<P2TPHIF>
extern volatile __bit                   P2TPHIF             __at(0x4202);	// @ (0x840 * 8 + 2)
#define                                 P2TPHIF_bit         _BIT_ACCESS(PSMC2INT,2)
// PSMC2INT<P2TPRIE>
extern volatile __bit                   P2TPRIE             __at(0x4204);	// @ (0x840 * 8 + 4)
#define                                 P2TPRIE_bit         _BIT_ACCESS(PSMC2INT,4)
// PSMC2INT<P2TPRIF>
extern volatile __bit                   P2TPRIF             __at(0x4200);	// @ (0x840 * 8 + 0)
#define                                 P2TPRIF_bit         _BIT_ACCESS(PSMC2INT,0)
// PSMC3ASDC<P3ARSEN>
extern volatile __bit                   P3ARSEN             __at(0x42ED);	// @ (0x85D * 8 + 5)
#define                                 P3ARSEN_bit         _BIT_ACCESS(PSMC3ASDC,5)
// PSMC3ASDC<P3ASDEN>
extern volatile __bit                   P3ASDEN             __at(0x42EE);	// @ (0x85D * 8 + 6)
#define                                 P3ASDEN_bit         _BIT_ACCESS(PSMC3ASDC,6)
// PSMC3ASDL<P3ASDLA>
extern volatile __bit                   P3ASDLA             __at(0x42F0);	// @ (0x85E * 8 + 0)
#define                                 P3ASDLA_bit         _BIT_ACCESS(PSMC3ASDL,0)
// PSMC3ASDL<P3ASDLB>
extern volatile __bit                   P3ASDLB             __at(0x42F1);	// @ (0x85E * 8 + 1)
#define                                 P3ASDLB_bit         _BIT_ACCESS(PSMC3ASDL,1)
// PSMC3ASDL<P3ASDLC>
extern volatile __bit                   P3ASDLC             __at(0x42F2);	// @ (0x85E * 8 + 2)
#define                                 P3ASDLC_bit         _BIT_ACCESS(PSMC3ASDL,2)
// PSMC3ASDL<P3ASDLD>
extern volatile __bit                   P3ASDLD             __at(0x42F3);	// @ (0x85E * 8 + 3)
#define                                 P3ASDLD_bit         _BIT_ACCESS(PSMC3ASDL,3)
// PSMC3ASDL<P3ASDLE>
extern volatile __bit                   P3ASDLE             __at(0x42F4);	// @ (0x85E * 8 + 4)
#define                                 P3ASDLE_bit         _BIT_ACCESS(PSMC3ASDL,4)
// PSMC3ASDL<P3ASDLF>
extern volatile __bit                   P3ASDLF             __at(0x42F5);	// @ (0x85E * 8 + 5)
#define                                 P3ASDLF_bit         _BIT_ACCESS(PSMC3ASDL,5)
// PSMC3ASDC<P3ASDOV>
extern volatile __bit                   P3ASDOV             __at(0x42E8);	// @ (0x85D * 8 + 0)
#define                                 P3ASDOV_bit         _BIT_ACCESS(PSMC3ASDC,0)
// PSMC3ASDS<P3ASDSC1>
extern volatile __bit                   P3ASDSC1            __at(0x42F9);	// @ (0x85F * 8 + 1)
#define                                 P3ASDSC1_bit        _BIT_ACCESS(PSMC3ASDS,1)
// PSMC3ASDS<P3ASDSC2>
extern volatile __bit                   P3ASDSC2            __at(0x42FA);	// @ (0x85F * 8 + 2)
#define                                 P3ASDSC2_bit        _BIT_ACCESS(PSMC3ASDS,2)
// PSMC3ASDS<P3ASDSC3>
extern volatile __bit                   P3ASDSC3            __at(0x42FB);	// @ (0x85F * 8 + 3)
#define                                 P3ASDSC3_bit        _BIT_ACCESS(PSMC3ASDS,3)
// PSMC3ASDS<P3ASDSC4>
extern volatile __bit                   P3ASDSC4            __at(0x42FC);	// @ (0x85F * 8 + 4)
#define                                 P3ASDSC4_bit        _BIT_ACCESS(PSMC3ASDS,4)
// PSMC3ASDS<P3ASDSIN>
extern volatile __bit                   P3ASDSIN            __at(0x42FF);	// @ (0x85F * 8 + 7)
#define                                 P3ASDSIN_bit        _BIT_ACCESS(PSMC3ASDS,7)
// PSMC3ASDC<P3ASE>
extern volatile __bit                   P3ASE               __at(0x42EF);	// @ (0x85D * 8 + 7)
#define                                 P3ASE_bit           _BIT_ACCESS(PSMC3ASDC,7)
// PSMC3CLK<P3CPRE0>
extern volatile __bit                   P3CPRE0             __at(0x42A4);	// @ (0x854 * 8 + 4)
#define                                 P3CPRE0_bit         _BIT_ACCESS(PSMC3CLK,4)
// PSMC3CLK<P3CPRE1>
extern volatile __bit                   P3CPRE1             __at(0x42A5);	// @ (0x854 * 8 + 5)
#define                                 P3CPRE1_bit         _BIT_ACCESS(PSMC3CLK,5)
// PSMC3CLK<P3CSRC0>
extern volatile __bit                   P3CSRC0             __at(0x42A0);	// @ (0x854 * 8 + 0)
#define                                 P3CSRC0_bit         _BIT_ACCESS(PSMC3CLK,0)
// PSMC3CLK<P3CSRC1>
extern volatile __bit                   P3CSRC1             __at(0x42A1);	// @ (0x854 * 8 + 1)
#define                                 P3CSRC1_bit         _BIT_ACCESS(PSMC3CLK,1)
// PSMC3CON<P3DBFE>
extern volatile __bit                   P3DBFE              __at(0x428D);	// @ (0x851 * 8 + 5)
#define                                 P3DBFE_bit          _BIT_ACCESS(PSMC3CON,5)
// PSMC3CON<P3DBRE>
extern volatile __bit                   P3DBRE              __at(0x428C);	// @ (0x851 * 8 + 4)
#define                                 P3DBRE_bit          _BIT_ACCESS(PSMC3CON,4)
// PSMC3SYNC<P3DCPOL>
extern volatile __bit                   P3DCPOL             __at(0x429D);	// @ (0x853 * 8 + 5)
#define                                 P3DCPOL_bit         _BIT_ACCESS(PSMC3SYNC,5)
// PSMC3DCS<P3DCSC1>
extern volatile __bit                   P3DCSC1             __at(0x42D9);	// @ (0x85B * 8 + 1)
#define                                 P3DCSC1_bit         _BIT_ACCESS(PSMC3DCS,1)
// PSMC3DCS<P3DCSC2>
extern volatile __bit                   P3DCSC2             __at(0x42DA);	// @ (0x85B * 8 + 2)
#define                                 P3DCSC2_bit         _BIT_ACCESS(PSMC3DCS,2)
// PSMC3DCS<P3DCSC3>
extern volatile __bit                   P3DCSC3             __at(0x42DB);	// @ (0x85B * 8 + 3)
#define                                 P3DCSC3_bit         _BIT_ACCESS(PSMC3DCS,3)
// PSMC3DCS<P3DCSC4>
extern volatile __bit                   P3DCSC4             __at(0x42DC);	// @ (0x85B * 8 + 4)
#define                                 P3DCSC4_bit         _BIT_ACCESS(PSMC3DCS,4)
// PSMC3DCS<P3DCSIN>
extern volatile __bit                   P3DCSIN             __at(0x42DF);	// @ (0x85B * 8 + 7)
#define                                 P3DCSIN_bit         _BIT_ACCESS(PSMC3DCS,7)
// PSMC3DCS<P3DCST>
extern volatile __bit                   P3DCST              __at(0x42D8);	// @ (0x85B * 8 + 0)
#define                                 P3DCST_bit          _BIT_ACCESS(PSMC3DCS,0)
// PSMC3BLNK<P3FEBM0>
extern volatile __bit                   P3FEBM0             __at(0x42BC);	// @ (0x857 * 8 + 4)
#define                                 P3FEBM0_bit         _BIT_ACCESS(PSMC3BLNK,4)
// PSMC3BLNK<P3FEBM1>
extern volatile __bit                   P3FEBM1             __at(0x42BD);	// @ (0x857 * 8 + 5)
#define                                 P3FEBM1_bit         _BIT_ACCESS(PSMC3BLNK,5)
// PSMC3FEBS<P3FEBSC1>
extern volatile __bit                   P3FEBSC1            __at(0x42C9);	// @ (0x859 * 8 + 1)
#define                                 P3FEBSC1_bit        _BIT_ACCESS(PSMC3FEBS,1)
// PSMC3FEBS<P3FEBSC2>
extern volatile __bit                   P3FEBSC2            __at(0x42CA);	// @ (0x859 * 8 + 2)
#define                                 P3FEBSC2_bit        _BIT_ACCESS(PSMC3FEBS,2)
// PSMC3FEBS<P3FEBSC3>
extern volatile __bit                   P3FEBSC3            __at(0x42CB);	// @ (0x859 * 8 + 3)
#define                                 P3FEBSC3_bit        _BIT_ACCESS(PSMC3FEBS,3)
// PSMC3FEBS<P3FEBSC4>
extern volatile __bit                   P3FEBSC4            __at(0x42CC);	// @ (0x859 * 8 + 4)
#define                                 P3FEBSC4_bit        _BIT_ACCESS(PSMC3FEBS,4)
// PSMC3FEBS<P3FEBSIN>
extern volatile __bit                   P3FEBSIN            __at(0x42CF);	// @ (0x859 * 8 + 7)
#define                                 P3FEBSIN_bit        _BIT_ACCESS(PSMC3FEBS,7)
// PSMC3STR1<P3HSMEN>
extern volatile __bit                   P3HSMEN             __at(0x4378);	// @ (0x86F * 8 + 0)
#define                                 P3HSMEN_bit         _BIT_ACCESS(PSMC3STR1,0)
// PSMC3POL<P3INPOL>
extern volatile __bit                   P3INPOL             __at(0x42B6);	// @ (0x856 * 8 + 6)
#define                                 P3INPOL_bit         _BIT_ACCESS(PSMC3POL,6)
// PSMC3STR1<P3LSMEN>
extern volatile __bit                   P3LSMEN             __at(0x4379);	// @ (0x86F * 8 + 1)
#define                                 P3LSMEN_bit         _BIT_ACCESS(PSMC3STR1,1)
// PSMC3MDL<P3MDLBIT>
extern volatile __bit                   P3MDLBIT            __at(0x4295);	// @ (0x852 * 8 + 5)
#define                                 P3MDLBIT_bit        _BIT_ACCESS(PSMC3MDL,5)
// PSMC3MDL<P3MDLEN>
extern volatile __bit                   P3MDLEN             __at(0x4297);	// @ (0x852 * 8 + 7)
#define                                 P3MDLEN_bit         _BIT_ACCESS(PSMC3MDL,7)
// PSMC3MDL<P3MDLPOL>
extern volatile __bit                   P3MDLPOL            __at(0x4296);	// @ (0x852 * 8 + 6)
#define                                 P3MDLPOL_bit        _BIT_ACCESS(PSMC3MDL,6)
// PSMC3CON<P3MODE0>
extern volatile __bit                   P3MODE0             __at(0x4288);	// @ (0x851 * 8 + 0)
#define                                 P3MODE0_bit         _BIT_ACCESS(PSMC3CON,0)
// PSMC3CON<P3MODE1>
extern volatile __bit                   P3MODE1             __at(0x4289);	// @ (0x851 * 8 + 1)
#define                                 P3MODE1_bit         _BIT_ACCESS(PSMC3CON,1)
// PSMC3CON<P3MODE2>
extern volatile __bit                   P3MODE2             __at(0x428A);	// @ (0x851 * 8 + 2)
#define                                 P3MODE2_bit         _BIT_ACCESS(PSMC3CON,2)
// PSMC3CON<P3MODE3>
extern volatile __bit                   P3MODE3             __at(0x428B);	// @ (0x851 * 8 + 3)
#define                                 P3MODE3_bit         _BIT_ACCESS(PSMC3CON,3)
// PSMC3MDL<P3MSRC0>
extern volatile __bit                   P3MSRC0             __at(0x4290);	// @ (0x852 * 8 + 0)
#define                                 P3MSRC0_bit         _BIT_ACCESS(PSMC3MDL,0)
// PSMC3MDL<P3MSRC1>
extern volatile __bit                   P3MSRC1             __at(0x4291);	// @ (0x852 * 8 + 1)
#define                                 P3MSRC1_bit         _BIT_ACCESS(PSMC3MDL,1)
// PSMC3MDL<P3MSRC2>
extern volatile __bit                   P3MSRC2             __at(0x4292);	// @ (0x852 * 8 + 2)
#define                                 P3MSRC2_bit         _BIT_ACCESS(PSMC3MDL,2)
// PSMC3MDL<P3MSRC3>
extern volatile __bit                   P3MSRC3             __at(0x4293);	// @ (0x852 * 8 + 3)
#define                                 P3MSRC3_bit         _BIT_ACCESS(PSMC3MDL,3)
// PSMC3OEN<P3OEA>
extern volatile __bit                   P3OEA               __at(0x42A8);	// @ (0x855 * 8 + 0)
#define                                 P3OEA_bit           _BIT_ACCESS(PSMC3OEN,0)
// PSMC3OEN<P3OEB>
extern volatile __bit                   P3OEB               __at(0x42A9);	// @ (0x855 * 8 + 1)
#define                                 P3OEB_bit           _BIT_ACCESS(PSMC3OEN,1)
// PSMC3OEN<P3OEC>
extern volatile __bit                   P3OEC               __at(0x42AA);	// @ (0x855 * 8 + 2)
#define                                 P3OEC_bit           _BIT_ACCESS(PSMC3OEN,2)
// PSMC3OEN<P3OED>
extern volatile __bit                   P3OED               __at(0x42AB);	// @ (0x855 * 8 + 3)
#define                                 P3OED_bit           _BIT_ACCESS(PSMC3OEN,3)
// PSMC3OEN<P3OEE>
extern volatile __bit                   P3OEE               __at(0x42AC);	// @ (0x855 * 8 + 4)
#define                                 P3OEE_bit           _BIT_ACCESS(PSMC3OEN,4)
// PSMC3OEN<P3OEF>
extern volatile __bit                   P3OEF               __at(0x42AD);	// @ (0x855 * 8 + 5)
#define                                 P3OEF_bit           _BIT_ACCESS(PSMC3OEN,5)
// PSMC3PHS<P3PHSC1>
extern volatile __bit                   P3PHSC1             __at(0x42D1);	// @ (0x85A * 8 + 1)
#define                                 P3PHSC1_bit         _BIT_ACCESS(PSMC3PHS,1)
// PSMC3PHS<P3PHSC2>
extern volatile __bit                   P3PHSC2             __at(0x42D2);	// @ (0x85A * 8 + 2)
#define                                 P3PHSC2_bit         _BIT_ACCESS(PSMC3PHS,2)
// PSMC3PHS<P3PHSC3>
extern volatile __bit                   P3PHSC3             __at(0x42D3);	// @ (0x85A * 8 + 3)
#define                                 P3PHSC3_bit         _BIT_ACCESS(PSMC3PHS,3)
// PSMC3PHS<P3PHSC4>
extern volatile __bit                   P3PHSC4             __at(0x42D4);	// @ (0x85A * 8 + 4)
#define                                 P3PHSC4_bit         _BIT_ACCESS(PSMC3PHS,4)
// PSMC3PHS<P3PHSIN>
extern volatile __bit                   P3PHSIN             __at(0x42D7);	// @ (0x85A * 8 + 7)
#define                                 P3PHSIN_bit         _BIT_ACCESS(PSMC3PHS,7)
// PSMC3PHS<P3PHST>
extern volatile __bit                   P3PHST              __at(0x42D0);	// @ (0x85A * 8 + 0)
#define                                 P3PHST_bit          _BIT_ACCESS(PSMC3PHS,0)
// PSMC3SYNC<P3POFST>
extern volatile __bit                   P3POFST             __at(0x429F);	// @ (0x853 * 8 + 7)
#define                                 P3POFST_bit         _BIT_ACCESS(PSMC3SYNC,7)
// PSMC3POL<P3POLA>
extern volatile __bit                   P3POLA              __at(0x42B0);	// @ (0x856 * 8 + 0)
#define                                 P3POLA_bit          _BIT_ACCESS(PSMC3POL,0)
// PSMC3POL<P3POLB>
extern volatile __bit                   P3POLB              __at(0x42B1);	// @ (0x856 * 8 + 1)
#define                                 P3POLB_bit          _BIT_ACCESS(PSMC3POL,1)
// PSMC3POL<P3POLC>
extern volatile __bit                   P3POLC              __at(0x42B2);	// @ (0x856 * 8 + 2)
#define                                 P3POLC_bit          _BIT_ACCESS(PSMC3POL,2)
// PSMC3POL<P3POLD>
extern volatile __bit                   P3POLD              __at(0x42B3);	// @ (0x856 * 8 + 3)
#define                                 P3POLD_bit          _BIT_ACCESS(PSMC3POL,3)
// PSMC3POL<P3POLE>
extern volatile __bit                   P3POLE              __at(0x42B4);	// @ (0x856 * 8 + 4)
#define                                 P3POLE_bit          _BIT_ACCESS(PSMC3POL,4)
// PSMC3POL<P3POLF>
extern volatile __bit                   P3POLF              __at(0x42B5);	// @ (0x856 * 8 + 5)
#define                                 P3POLF_bit          _BIT_ACCESS(PSMC3POL,5)
// PSMC3SYNC<P3PRPOL>
extern volatile __bit                   P3PRPOL             __at(0x429E);	// @ (0x853 * 8 + 6)
#define                                 P3PRPOL_bit         _BIT_ACCESS(PSMC3SYNC,6)
// PSMC3PRS<P3PRSC1>
extern volatile __bit                   P3PRSC1             __at(0x42E1);	// @ (0x85C * 8 + 1)
#define                                 P3PRSC1_bit         _BIT_ACCESS(PSMC3PRS,1)
// PSMC3PRS<P3PRSC2>
extern volatile __bit                   P3PRSC2             __at(0x42E2);	// @ (0x85C * 8 + 2)
#define                                 P3PRSC2_bit         _BIT_ACCESS(PSMC3PRS,2)
// PSMC3PRS<P3PRSC3>
extern volatile __bit                   P3PRSC3             __at(0x42E3);	// @ (0x85C * 8 + 3)
#define                                 P3PRSC3_bit         _BIT_ACCESS(PSMC3PRS,3)
// PSMC3PRS<P3PRSC4>
extern volatile __bit                   P3PRSC4             __at(0x42E4);	// @ (0x85C * 8 + 4)
#define                                 P3PRSC4_bit         _BIT_ACCESS(PSMC3PRS,4)
// PSMC3PRS<P3PRSIN>
extern volatile __bit                   P3PRSIN             __at(0x42E7);	// @ (0x85C * 8 + 7)
#define                                 P3PRSIN_bit         _BIT_ACCESS(PSMC3PRS,7)
// PSMC3PRS<P3PRST>
extern volatile __bit                   P3PRST              __at(0x42E0);	// @ (0x85C * 8 + 0)
#define                                 P3PRST_bit          _BIT_ACCESS(PSMC3PRS,0)
// PSMC3BLNK<P3REBM0>
extern volatile __bit                   P3REBM0             __at(0x42B8);	// @ (0x857 * 8 + 0)
#define                                 P3REBM0_bit         _BIT_ACCESS(PSMC3BLNK,0)
// PSMC3BLNK<P3REBM1>
extern volatile __bit                   P3REBM1             __at(0x42B9);	// @ (0x857 * 8 + 1)
#define                                 P3REBM1_bit         _BIT_ACCESS(PSMC3BLNK,1)
// PSMC3REBS<P3REBSC1>
extern volatile __bit                   P3REBSC1            __at(0x42C1);	// @ (0x858 * 8 + 1)
#define                                 P3REBSC1_bit        _BIT_ACCESS(PSMC3REBS,1)
// PSMC3REBS<P3REBSC2>
extern volatile __bit                   P3REBSC2            __at(0x42C2);	// @ (0x858 * 8 + 2)
#define                                 P3REBSC2_bit        _BIT_ACCESS(PSMC3REBS,2)
// PSMC3REBS<P3REBSC3>
extern volatile __bit                   P3REBSC3            __at(0x42C3);	// @ (0x858 * 8 + 3)
#define                                 P3REBSC3_bit        _BIT_ACCESS(PSMC3REBS,3)
// PSMC3REBS<P3REBSC4>
extern volatile __bit                   P3REBSC4            __at(0x42C4);	// @ (0x858 * 8 + 4)
#define                                 P3REBSC4_bit        _BIT_ACCESS(PSMC3REBS,4)
// PSMC3REBS<P3REBSIN>
extern volatile __bit                   P3REBSIN            __at(0x42C7);	// @ (0x858 * 8 + 7)
#define                                 P3REBSIN_bit        _BIT_ACCESS(PSMC3REBS,7)
// PSMC3STR1<P3SSYNC>
extern volatile __bit                   P3SSYNC             __at(0x437F);	// @ (0x86F * 8 + 7)
#define                                 P3SSYNC_bit         _BIT_ACCESS(PSMC3STR1,7)
// PSMC3STR0<P3STRA>
extern volatile __bit                   P3STRA              __at(0x4370);	// @ (0x86E * 8 + 0)
#define                                 P3STRA_bit          _BIT_ACCESS(PSMC3STR0,0)
// PSMC3STR0<P3STRB>
extern volatile __bit                   P3STRB              __at(0x4371);	// @ (0x86E * 8 + 1)
#define                                 P3STRB_bit          _BIT_ACCESS(PSMC3STR0,1)
// PSMC3STR0<P3STRC>
extern volatile __bit                   P3STRC              __at(0x4372);	// @ (0x86E * 8 + 2)
#define                                 P3STRC_bit          _BIT_ACCESS(PSMC3STR0,2)
// PSMC3STR0<P3STRD>
extern volatile __bit                   P3STRD              __at(0x4373);	// @ (0x86E * 8 + 3)
#define                                 P3STRD_bit          _BIT_ACCESS(PSMC3STR0,3)
// PSMC3STR0<P3STRE>
