MikroElektronika/core_packages/PIC/XC8/def/PIC16F1784/mcu.h
extern volatile __bit                   RC1                 __at(0x71);	// @ (0xE * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PORTC<RC2>
extern volatile __bit                   RC2                 __at(0x72);	// @ (0xE * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PORTC<RC3>
extern volatile __bit                   RC3                 __at(0x73);	// @ (0xE * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit                   RC4                 __at(0x74);	// @ (0xE * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit                   RC5                 __at(0x75);	// @ (0xE * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit                   RC6                 __at(0x76);	// @ (0xE * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit                   RC7                 __at(0x77);	// @ (0xE * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// SSP1CON2<RCEN>
extern volatile __bit                   RCEN                __at(0x10B3);	// @ (0x216 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// BAUD1CON<RCIDL>
extern volatile __bit                   RCIDL               __at(0xCFE);	// @ (0x19F * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUD1CON,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x8D);	// @ (0x11 * 8 + 5)
#define                                 RCIF_bit            _BIT_ACCESS(PIR1,5)
// EECON1<RD>
extern volatile __bit                   RD                  __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 RD_bit              _BIT_ACCESS(EECON1,0)
// PORTD<RD0>
extern volatile __bit                   RD0                 __at(0x78);	// @ (0xF * 8 + 0)
#define                                 RD0_bit             _BIT_ACCESS(PORTD,0)
// PORTD<RD1>
extern volatile __bit                   RD1                 __at(0x79);	// @ (0xF * 8 + 1)
#define                                 RD1_bit             _BIT_ACCESS(PORTD,1)
// PORTD<RD2>
extern volatile __bit                   RD2                 __at(0x7A);	// @ (0xF * 8 + 2)
#define                                 RD2_bit             _BIT_ACCESS(PORTD,2)
// PORTD<RD3>
extern volatile __bit                   RD3                 __at(0x7B);	// @ (0xF * 8 + 3)
#define                                 RD3_bit             _BIT_ACCESS(PORTD,3)
// PORTD<RD4>
extern volatile __bit                   RD4                 __at(0x7C);	// @ (0xF * 8 + 4)
#define                                 RD4_bit             _BIT_ACCESS(PORTD,4)
// PORTD<RD5>
extern volatile __bit                   RD5                 __at(0x7D);	// @ (0xF * 8 + 5)
#define                                 RD5_bit             _BIT_ACCESS(PORTD,5)
// PORTD<RD6>
extern volatile __bit                   RD6                 __at(0x7E);	// @ (0xF * 8 + 6)
#define                                 RD6_bit             _BIT_ACCESS(PORTD,6)
// PORTD<RD7>
extern volatile __bit                   RD7                 __at(0x7F);	// @ (0xF * 8 + 7)
#define                                 RD7_bit             _BIT_ACCESS(PORTD,7)
// PORTE<RE0>
extern volatile __bit                   RE0                 __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 RE0_bit             _BIT_ACCESS(PORTE,0)
// PORTE<RE1>
extern volatile __bit                   RE1                 __at(0x81);	// @ (0x10 * 8 + 1)
#define                                 RE1_bit             _BIT_ACCESS(PORTE,1)
// PORTE<RE2>
extern volatile __bit                   RE2                 __at(0x82);	// @ (0x10 * 8 + 2)
#define                                 RE2_bit             _BIT_ACCESS(PORTE,2)
// PORTE<RE3>
extern volatile __bit                   RE3                 __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 RE3_bit             _BIT_ACCESS(PORTE,3)
// SSP1CON2<RSEN>
extern volatile __bit                   RSEN                __at(0x10B1);	// @ (0x216 * 8 + 1)
#define                                 RSEN_bit            _BIT_ACCESS(SSP1CON2,1)
// RC1STA<RX9>
extern volatile __bit                   RX9                 __at(0xCEE);	// @ (0x19D * 8 + 6)
#define                                 RX9_bit             _BIT_ACCESS(RC1STA,6)
// RC1STA<RX9D>
extern volatile __bit                   RX9D                __at(0xCE8);	// @ (0x19D * 8 + 0)
#define                                 RX9D_bit            _BIT_ACCESS(RC1STA,0)
// APFCON1<RXSEL>
extern volatile __bit                   RXSEL               __at(0x8E9);	// @ (0x11D * 8 + 1)
#define                                 RXSEL_bit           _BIT_ACCESS(APFCON1,1)
// SSP1STAT<R_nW>
extern volatile __bit                   R_nW                __at(0x10A2);	// @ (0x214 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSP1STAT,2)
// SSP1CON3<SBCDE>
extern volatile __bit                   SBCDE               __at(0x10BA);	// @ (0x217 * 8 + 2)
#define                                 SBCDE_bit           _BIT_ACCESS(SSP1CON3,2)
// BORCON<SBOREN>
extern volatile __bit                   SBOREN              __at(0x8B7);	// @ (0x116 * 8 + 7)
#define                                 SBOREN_bit          _BIT_ACCESS(BORCON,7)
// SSP1CON3<SCIE>
extern volatile __bit                   SCIE                __at(0x10BD);	// @ (0x217 * 8 + 5)
#define                                 SCIE_bit            _BIT_ACCESS(SSP1CON3,5)
// BAUD1CON<SCKP>
extern volatile __bit                   SCKP                __at(0xCFC);	// @ (0x19F * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUD1CON,4)
// APFCON1<SCKSEL>
extern volatile __bit                   SCKSEL              __at(0x8EC);	// @ (0x11D * 8 + 4)
#define                                 SCKSEL_bit          _BIT_ACCESS(APFCON1,4)
// OSCCON<SCS0>
extern volatile __bit                   SCS0                __at(0x4C8);	// @ (0x99 * 8 + 0)
#define                                 SCS0_bit            _BIT_ACCESS(OSCCON,0)
// OSCCON<SCS1>
extern volatile __bit                   SCS1                __at(0x4C9);	// @ (0x99 * 8 + 1)
#define                                 SCS1_bit            _BIT_ACCESS(OSCCON,1)
// SSP1CON3<SDAHT>
extern volatile __bit                   SDAHT               __at(0x10BB);	// @ (0x217 * 8 + 3)
#define                                 SDAHT_bit           _BIT_ACCESS(SSP1CON3,3)
// APFCON1<SDISEL>
extern volatile __bit                   SDISEL              __at(0x8EB);	// @ (0x11D * 8 + 3)
#define                                 SDISEL_bit          _BIT_ACCESS(APFCON1,3)
// APFCON1<SDOSEL>
extern volatile __bit                   SDOSEL              __at(0x8ED);	// @ (0x11D * 8 + 5)
#define                                 SDOSEL_bit          _BIT_ACCESS(APFCON1,5)
// SSP1CON2<SEN>
extern volatile __bit                   SEN                 __at(0x10B0);	// @ (0x216 * 8 + 0)
#define                                 SEN_bit             _BIT_ACCESS(SSP1CON2,0)
// TX1STA<SENDB>
extern volatile __bit                   SENDB               __at(0xCF3);	// @ (0x19E * 8 + 3)
#define                                 SENDB_bit           _BIT_ACCESS(TX1STA,3)
// SLRCONA<SLRCONA0>
extern volatile __bit                   SLRCONA0            __at(0x1860);	// @ (0x30C * 8 + 0)
#define                                 SLRCONA0_bit        _BIT_ACCESS(SLRCONA,0)
// SLRCONA<SLRCONA1>
extern volatile __bit                   SLRCONA1            __at(0x1861);	// @ (0x30C * 8 + 1)
#define                                 SLRCONA1_bit        _BIT_ACCESS(SLRCONA,1)
// SLRCONA<SLRCONA2>
extern volatile __bit                   SLRCONA2            __at(0x1862);	// @ (0x30C * 8 + 2)
#define                                 SLRCONA2_bit        _BIT_ACCESS(SLRCONA,2)
// SLRCONA<SLRCONA3>
extern volatile __bit                   SLRCONA3            __at(0x1863);	// @ (0x30C * 8 + 3)
#define                                 SLRCONA3_bit        _BIT_ACCESS(SLRCONA,3)
// SLRCONA<SLRCONA4>
extern volatile __bit                   SLRCONA4            __at(0x1864);	// @ (0x30C * 8 + 4)
#define                                 SLRCONA4_bit        _BIT_ACCESS(SLRCONA,4)
// SLRCONA<SLRCONA5>
extern volatile __bit                   SLRCONA5            __at(0x1865);	// @ (0x30C * 8 + 5)
#define                                 SLRCONA5_bit        _BIT_ACCESS(SLRCONA,5)
// SLRCONA<SLRCONA6>
extern volatile __bit                   SLRCONA6            __at(0x1866);	// @ (0x30C * 8 + 6)
#define                                 SLRCONA6_bit        _BIT_ACCESS(SLRCONA,6)
// SLRCONA<SLRCONA7>
extern volatile __bit                   SLRCONA7            __at(0x1867);	// @ (0x30C * 8 + 7)
#define                                 SLRCONA7_bit        _BIT_ACCESS(SLRCONA,7)
// SLRCONB<SLRCONB0>
extern volatile __bit                   SLRCONB0            __at(0x1868);	// @ (0x30D * 8 + 0)
#define                                 SLRCONB0_bit        _BIT_ACCESS(SLRCONB,0)
// SLRCONB<SLRCONB1>
extern volatile __bit                   SLRCONB1            __at(0x1869);	// @ (0x30D * 8 + 1)
#define                                 SLRCONB1_bit        _BIT_ACCESS(SLRCONB,1)
// SLRCONB<SLRCONB2>
extern volatile __bit                   SLRCONB2            __at(0x186A);	// @ (0x30D * 8 + 2)
#define                                 SLRCONB2_bit        _BIT_ACCESS(SLRCONB,2)
// SLRCONB<SLRCONB3>
extern volatile __bit                   SLRCONB3            __at(0x186B);	// @ (0x30D * 8 + 3)
#define                                 SLRCONB3_bit        _BIT_ACCESS(SLRCONB,3)
// SLRCONB<SLRCONB4>
extern volatile __bit                   SLRCONB4            __at(0x186C);	// @ (0x30D * 8 + 4)
#define                                 SLRCONB4_bit        _BIT_ACCESS(SLRCONB,4)
// SLRCONB<SLRCONB5>
extern volatile __bit                   SLRCONB5            __at(0x186D);	// @ (0x30D * 8 + 5)
#define                                 SLRCONB5_bit        _BIT_ACCESS(SLRCONB,5)
// SLRCONB<SLRCONB6>
extern volatile __bit                   SLRCONB6            __at(0x186E);	// @ (0x30D * 8 + 6)
#define                                 SLRCONB6_bit        _BIT_ACCESS(SLRCONB,6)
// SLRCONB<SLRCONB7>
extern volatile __bit                   SLRCONB7            __at(0x186F);	// @ (0x30D * 8 + 7)
#define                                 SLRCONB7_bit        _BIT_ACCESS(SLRCONB,7)
// SLRCONC<SLRCONC0>
extern volatile __bit                   SLRCONC0            __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 SLRCONC0_bit        _BIT_ACCESS(SLRCONC,0)
// SLRCONC<SLRCONC1>
extern volatile __bit                   SLRCONC1            __at(0x1871);	// @ (0x30E * 8 + 1)
#define                                 SLRCONC1_bit        _BIT_ACCESS(SLRCONC,1)
// SLRCONC<SLRCONC2>
extern volatile __bit                   SLRCONC2            __at(0x1872);	// @ (0x30E * 8 + 2)
#define                                 SLRCONC2_bit        _BIT_ACCESS(SLRCONC,2)
// SLRCONC<SLRCONC3>
extern volatile __bit                   SLRCONC3            __at(0x1873);	// @ (0x30E * 8 + 3)
#define                                 SLRCONC3_bit        _BIT_ACCESS(SLRCONC,3)
// SLRCONC<SLRCONC4>
extern volatile __bit                   SLRCONC4            __at(0x1874);	// @ (0x30E * 8 + 4)
#define                                 SLRCONC4_bit        _BIT_ACCESS(SLRCONC,4)
// SLRCONC<SLRCONC5>
extern volatile __bit                   SLRCONC5            __at(0x1875);	// @ (0x30E * 8 + 5)
#define                                 SLRCONC5_bit        _BIT_ACCESS(SLRCONC,5)
// SLRCONC<SLRCONC6>
extern volatile __bit                   SLRCONC6            __at(0x1876);	// @ (0x30E * 8 + 6)
#define                                 SLRCONC6_bit        _BIT_ACCESS(SLRCONC,6)
// SLRCONC<SLRCONC7>
extern volatile __bit                   SLRCONC7            __at(0x1877);	// @ (0x30E * 8 + 7)
#define                                 SLRCONC7_bit        _BIT_ACCESS(SLRCONC,7)
// SLRCOND<SLRCOND0>
extern volatile __bit                   SLRCOND0            __at(0x1878);	// @ (0x30F * 8 + 0)
#define                                 SLRCOND0_bit        _BIT_ACCESS(SLRCOND,0)
// SLRCOND<SLRCOND1>
extern volatile __bit                   SLRCOND1            __at(0x1879);	// @ (0x30F * 8 + 1)
#define                                 SLRCOND1_bit        _BIT_ACCESS(SLRCOND,1)
// SLRCOND<SLRCOND2>
extern volatile __bit                   SLRCOND2            __at(0x187A);	// @ (0x30F * 8 + 2)
#define                                 SLRCOND2_bit        _BIT_ACCESS(SLRCOND,2)
// SLRCOND<SLRCOND3>
extern volatile __bit                   SLRCOND3            __at(0x187B);	// @ (0x30F * 8 + 3)
#define                                 SLRCOND3_bit        _BIT_ACCESS(SLRCOND,3)
// SLRCOND<SLRCOND4>
extern volatile __bit                   SLRCOND4            __at(0x187C);	// @ (0x30F * 8 + 4)
#define                                 SLRCOND4_bit        _BIT_ACCESS(SLRCOND,4)
// SLRCOND<SLRCOND5>
extern volatile __bit                   SLRCOND5            __at(0x187D);	// @ (0x30F * 8 + 5)
#define                                 SLRCOND5_bit        _BIT_ACCESS(SLRCOND,5)
// SLRCOND<SLRCOND6>
extern volatile __bit                   SLRCOND6            __at(0x187E);	// @ (0x30F * 8 + 6)
#define                                 SLRCOND6_bit        _BIT_ACCESS(SLRCOND,6)
// SLRCOND<SLRCOND7>
extern volatile __bit                   SLRCOND7            __at(0x187F);	// @ (0x30F * 8 + 7)
#define                                 SLRCOND7_bit        _BIT_ACCESS(SLRCOND,7)
// SLRCONE<SLRCONE0>
extern volatile __bit                   SLRCONE0            __at(0x1880);	// @ (0x310 * 8 + 0)
#define                                 SLRCONE0_bit        _BIT_ACCESS(SLRCONE,0)
// SLRCONE<SLRCONE1>
extern volatile __bit                   SLRCONE1            __at(0x1881);	// @ (0x310 * 8 + 1)
#define                                 SLRCONE1_bit        _BIT_ACCESS(SLRCONE,1)
// SLRCONE<SLRCONE2>
extern volatile __bit                   SLRCONE2            __at(0x1882);	// @ (0x310 * 8 + 2)
#define                                 SLRCONE2_bit        _BIT_ACCESS(SLRCONE,2)
// SSP1STAT<SMP>
extern volatile __bit                   SMP                 __at(0x10A7);	// @ (0x214 * 8 + 7)
#define                                 SMP_bit             _BIT_ACCESS(SSP1STAT,7)
// RC1STA<SPEN>
extern volatile __bit                   SPEN                __at(0xCEF);	// @ (0x19D * 8 + 7)
#define                                 SPEN_bit            _BIT_ACCESS(RC1STA,7)
// OSCCON<SPLLEN>
extern volatile __bit                   SPLLEN              __at(0x4CF);	// @ (0x99 * 8 + 7)
#define                                 SPLLEN_bit          _BIT_ACCESS(OSCCON,7)
// RC1STA<SREN>
extern volatile __bit                   SREN                __at(0xCED);	// @ (0x19D * 8 + 5)
#define                                 SREN_bit            _BIT_ACCESS(RC1STA,5)
// SSP1ADD<SSP1ADD0>
extern volatile __bit                   SSP1ADD0            __at(0x1090);	// @ (0x212 * 8 + 0)
#define                                 SSP1ADD0_bit        _BIT_ACCESS(SSP1ADD,0)
// SSP1ADD<SSP1ADD1>
extern volatile __bit                   SSP1ADD1            __at(0x1091);	// @ (0x212 * 8 + 1)
#define                                 SSP1ADD1_bit        _BIT_ACCESS(SSP1ADD,1)
// SSP1ADD<SSP1ADD2>
extern volatile __bit                   SSP1ADD2            __at(0x1092);	// @ (0x212 * 8 + 2)
#define                                 SSP1ADD2_bit        _BIT_ACCESS(SSP1ADD,2)
// SSP1ADD<SSP1ADD3>
extern volatile __bit                   SSP1ADD3            __at(0x1093);	// @ (0x212 * 8 + 3)
#define                                 SSP1ADD3_bit        _BIT_ACCESS(SSP1ADD,3)
// SSP1ADD<SSP1ADD4>
extern volatile __bit                   SSP1ADD4            __at(0x1094);	// @ (0x212 * 8 + 4)
#define                                 SSP1ADD4_bit        _BIT_ACCESS(SSP1ADD,4)
// SSP1ADD<SSP1ADD5>
extern volatile __bit                   SSP1ADD5            __at(0x1095);	// @ (0x212 * 8 + 5)
#define                                 SSP1ADD5_bit        _BIT_ACCESS(SSP1ADD,5)
// SSP1ADD<SSP1ADD6>
extern volatile __bit                   SSP1ADD6            __at(0x1096);	// @ (0x212 * 8 + 6)
#define                                 SSP1ADD6_bit        _BIT_ACCESS(SSP1ADD,6)
// SSP1ADD<SSP1ADD7>
extern volatile __bit                   SSP1ADD7            __at(0x1097);	// @ (0x212 * 8 + 7)
#define                                 SSP1ADD7_bit        _BIT_ACCESS(SSP1ADD,7)
// SSP1BUF<SSP1BUF0>
extern volatile __bit                   SSP1BUF0            __at(0x1088);	// @ (0x211 * 8 + 0)
#define                                 SSP1BUF0_bit        _BIT_ACCESS(SSP1BUF,0)
// SSP1BUF<SSP1BUF1>
extern volatile __bit                   SSP1BUF1            __at(0x1089);	// @ (0x211 * 8 + 1)
#define                                 SSP1BUF1_bit        _BIT_ACCESS(SSP1BUF,1)
// SSP1BUF<SSP1BUF2>
extern volatile __bit                   SSP1BUF2            __at(0x108A);	// @ (0x211 * 8 + 2)
#define                                 SSP1BUF2_bit        _BIT_ACCESS(SSP1BUF,2)
// SSP1BUF<SSP1BUF3>
extern volatile __bit                   SSP1BUF3            __at(0x108B);	// @ (0x211 * 8 + 3)
#define                                 SSP1BUF3_bit        _BIT_ACCESS(SSP1BUF,3)
// SSP1BUF<SSP1BUF4>
extern volatile __bit                   SSP1BUF4            __at(0x108C);	// @ (0x211 * 8 + 4)
#define                                 SSP1BUF4_bit        _BIT_ACCESS(SSP1BUF,4)
// SSP1BUF<SSP1BUF5>
extern volatile __bit                   SSP1BUF5            __at(0x108D);	// @ (0x211 * 8 + 5)
#define                                 SSP1BUF5_bit        _BIT_ACCESS(SSP1BUF,5)
// SSP1BUF<SSP1BUF6>
extern volatile __bit                   SSP1BUF6            __at(0x108E);	// @ (0x211 * 8 + 6)
#define                                 SSP1BUF6_bit        _BIT_ACCESS(SSP1BUF,6)
// SSP1BUF<SSP1BUF7>
extern volatile __bit                   SSP1BUF7            __at(0x108F);	// @ (0x211 * 8 + 7)
#define                                 SSP1BUF7_bit        _BIT_ACCESS(SSP1BUF,7)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x8B);	// @ (0x11 * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// SSP1MSK<SSP1MSK0>
extern volatile __bit                   SSP1MSK0            __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 SSP1MSK0_bit        _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<SSP1MSK1>
extern volatile __bit                   SSP1MSK1            __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 SSP1MSK1_bit        _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<SSP1MSK2>
extern volatile __bit                   SSP1MSK2            __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 SSP1MSK2_bit        _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<SSP1MSK3>
extern volatile __bit                   SSP1MSK3            __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 SSP1MSK3_bit        _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<SSP1MSK4>
extern volatile __bit                   SSP1MSK4            __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 SSP1MSK4_bit        _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<SSP1MSK5>
extern volatile __bit                   SSP1MSK5            __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 SSP1MSK5_bit        _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<SSP1MSK6>
extern volatile __bit                   SSP1MSK6            __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 SSP1MSK6_bit        _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<SSP1MSK7>
extern volatile __bit                   SSP1MSK7            __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 SSP1MSK7_bit        _BIT_ACCESS(SSP1MSK,7)
// SSP1CON1<SSPEN>
extern volatile __bit                   SSPEN               __at(0x10AD);	// @ (0x215 * 8 + 5)
#define                                 SSPEN_bit           _BIT_ACCESS(SSP1CON1,5)
// SSP1CON1<SSPM0>
extern volatile __bit                   SSPM0               __at(0x10A8);	// @ (0x215 * 8 + 0)
#define                                 SSPM0_bit           _BIT_ACCESS(SSP1CON1,0)
// SSP1CON1<SSPM1>
extern volatile __bit                   SSPM1               __at(0x10A9);	// @ (0x215 * 8 + 1)
#define                                 SSPM1_bit           _BIT_ACCESS(SSP1CON1,1)
// SSP1CON1<SSPM2>
extern volatile __bit                   SSPM2               __at(0x10AA);	// @ (0x215 * 8 + 2)
#define                                 SSPM2_bit           _BIT_ACCESS(SSP1CON1,2)
// SSP1CON1<SSPM3>
extern volatile __bit                   SSPM3               __at(0x10AB);	// @ (0x215 * 8 + 3)
#define                                 SSPM3_bit           _BIT_ACCESS(SSP1CON1,3)
// SSP1CON1<SSPOV>
extern volatile __bit                   SSPOV               __at(0x10AE);	// @ (0x215 * 8 + 6)
#define                                 SSPOV_bit           _BIT_ACCESS(SSP1CON1,6)
// PCON<STKOVF>
extern volatile __bit                   STKOVF              __at(0x4B7);	// @ (0x96 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON,7)
// PCON<STKUNF>
extern volatile __bit                   STKUNF              __at(0x4B6);	// @ (0x96 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON,6)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x4B8);	// @ (0x97 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// TX1STA<SYNC>
extern volatile __bit                   SYNC                __at(0xCF4);	// @ (0x19E * 8 + 4)
#define                                 SYNC_bit            _BIT_ACCESS(TX1STA,4)
// OPTION_REG<T0CS>
extern volatile __bit                   T0CS                __at(0x4AD);	// @ (0x95 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(OPTION_REG,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x5D);	// @ (0xB * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x5A);	// @ (0xB * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// OPTION_REG<T0SE>
extern volatile __bit                   T0SE                __at(0x4AC);	// @ (0x95 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(OPTION_REG,4)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0xC4);	// @ (0x18 * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0xC5);	// @ (0x18 * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0xCB);	// @ (0x19 * 8 + 3)
#define                                 T1GGO_bit           _BIT_ACCESS(T1GCON,3)
